---
kind: method
id: M:Autodesk.Revit.DB.DefinitionBindingMap.Insert(Autodesk.Revit.DB.Definition,Autodesk.Revit.DB.Binding)
source: html/6fe6da26-4194-2d01-d1f1-a72d51422cc1.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.Insert Method

## Syntax (C#)
```csharp
public virtual bool Insert(
	Definition key,
	Binding item
)
```

## Parameters
- **key** (`Autodesk.Revit.DB.Definition`)
- **item** (`Autodesk.Revit.DB.Binding`)